## 141 explode炸开数据堆

### explode：炸开数据堆
参数 column=（pandas 1.3 新增多列支持）, ignore_index=False

In [2]:
import numpy  as np
import pandas as pd
df = pd.DataFrame({'A': [[0, 1, 2], 'foo', [], [3, 4]],
                   'B': 1,
                   'C': [['a', 'b', 'c'], np.nan, [], ['d', 'e']]})

### 演示数据

In [6]:
df

           A  B          C
0  [0, 1, 2]  1  [a, b, c]
1        foo  1        NaN
2         []  1         []
3     [3, 4]  1     [d, e]

In [3]:
df.explode(column=['C','A']) # A C 列的 列表展开成多行.字符串列表

     A  B    C
0    0  1    a
0    1  1    b
0    2  1    c
1  foo  1  NaN
2  NaN  1  NaN
3    3  1    d
3    4  1    e

In [8]:
df.explode(column='C') # C 列的 列表展开成多行.字符串列表

           A  B    C
0  [0, 1, 2]  1    a
0  [0, 1, 2]  1    b
0  [0, 1, 2]  1    c
1        foo  1  NaN
2         []  1  NaN
3     [3, 4]  1    d
3     [3, 4]  1    e

In [7]:
df.explode('A',ignore_index=True) #ignore_index True会按照自然数排序索引

     A  B          C
0    0  1  [a, b, c]
1    1  1  [a, b, c]
2    2  1  [a, b, c]
3  foo  1        NaN
4  NaN  1         []
5    3  1     [d, e]
6    4  1     [d, e]

In [5]:
df.explode('A') # A 列的 列表展开成多行

     A  B          C
0    0  1  [a, b, c]
0    1  1  [a, b, c]
0    2  1  [a, b, c]
1  foo  1        NaN
2  NaN  1         []
3    3  1     [d, e]
3    4  1     [d, e]